app/Models/Barang_model.php

    public function getBarang($id = false)
    {
        if ($id === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['id_barang' => $id]);
---
SELECT *
FROM `barang`
SELECT *
FROM `barang`
WHERE `id_barang` = '8'

    public function saveBarang($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
---
INSERT INTO `barang` (`nama_barang`, `qty`, `harga_beli`, `harga_jual`) VALUES ('Krayon', '20', '15000', '17000')

    public function editBarang($data,$id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id_barang', $id);
        return $builder->update($data);
---
UPDATE `barang` SET `nama_barang` = 'Hvs', `qty` = '20', `harga_beli` = '500', `harga_jual` = '1000'
WHERE `id_barang` = '8'

        public function hapusBarang($id)
    {
        $builder = $this->db->table($this->table);
        return $builder->delete(['id_barang' => $id]);
---
DELETE FROM `barang`
WHERE `id_barang` = '8'